socialNetwork/results/benchmark1.5b-replica-scale-09-09-26_173920/scale-16x/istio/2000.txt
Running 2m test @ http://155.98.38.240:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 210.564ms, rate sampling interval: 910ms
  Thread calibration: mean lat.: 318.493ms, rate sampling interval: 1431ms
  Thread calibration: mean lat.: 284.648ms, rate sampling interval: 1253ms
  Thread calibration: mean lat.: 184.144ms, rate sampling interval: 770ms
  Thread calibration: mean lat.: 271.229ms, rate sampling interval: 1168ms
  Thread calibration: mean lat.: 257.805ms, rate sampling interval: 1165ms
  Thread calibration: mean lat.: 284.817ms, rate sampling interval: 1304ms
  Thread calibration: mean lat.: 217.704ms, rate sampling interval: 835ms
  Thread calibration: mean lat.: 275.011ms, rate sampling interval: 1128ms
  Thread calibration: mean lat.: 288.673ms, rate sampling interval: 1290ms
  Thread calibration: mean lat.: 298.702ms, rate sampling interval: 1383ms
  Thread calibration: mean lat.: 294.442ms, rate sampling interval: 1188ms
  Thread calibration: mean lat.: 260.214ms, rate sampling interval: 1195ms
  Thread calibration: mean lat.: 263.089ms, rate sampling interval: 1038ms
  Thread calibration: mean lat.: 233.769ms, rate sampling interval: 919ms
  Thread calibration: mean lat.: 262.453ms, rate sampling interval: 1217ms

-----------------------------------------------------------------------
Test Results @ http://155.98.38.240:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.79s     1.49s    6.77s    73.37%
    Req/Sec   122.19      5.88   135.00     76.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.43s 
 75.000%    2.56s 
 90.000%    3.75s 
 99.000%    6.77s 
 99.900%    9.16s 
 99.990%    9.78s 
 99.999%    9.90s 
100.000%    9.92s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.767     0.000000            1         1.00
     258.175     0.100000        21569         1.11
     496.895     0.200000        43127         1.25
     785.407     0.300000        64696         1.43
    1100.799     0.400000        86261         1.67
    1432.575     0.500000       107836         2.00
    1613.823     0.550000       118650         2.22
    1805.311     0.600000       129421         2.50
    2027.519     0.650000       140169         2.86
    2281.471     0.700000       150964         3.33
    2564.095     0.750000       161794         4.00
    2719.743     0.775000       167123         4.44
    2891.775     0.800000       172547         5.00
    3071.999     0.825000       177938         5.71
    3258.367     0.850000       183291         6.67
    3467.263     0.875000       188700         8.00
    3598.335     0.887500       191404         8.89
    3747.839     0.900000       194096        10.00
    3911.679     0.912500       196798        11.43
    4120.575     0.925000       199478        13.33
    4374.527     0.937500       202193        16.00
    4501.503     0.943750       203542        17.78
    4636.671     0.950000       204876        20.00
    4792.319     0.956250       206222        22.86
    5001.215     0.962500       207548        26.67
    5283.839     0.968750       208903        32.00
    5488.639     0.971875       209576        35.56
    5742.591     0.975000       210244        40.00
    5947.391     0.978125       210934        45.71
    6115.327     0.981250       211590        53.33
    6295.551     0.984375       212267        64.00
    6397.951     0.985938       212601        71.11
    6520.831     0.987500       212941        80.00
    6655.999     0.989062       213278        91.43
    6848.511     0.990625       213616       106.67
    7110.655     0.992188       213952       128.00
    7249.919     0.992969       214117       142.22
    7405.567     0.993750       214293       160.00
    7561.215     0.994531       214456       182.86
    7684.095     0.995313       214624       213.33
    7835.647     0.996094       214791       256.00
    7925.759     0.996484       214875       284.44
    8011.775     0.996875       214961       320.00
    8089.599     0.997266       215048       365.71
    8167.423     0.997656       215136       426.67
    8257.535     0.998047       215213       512.00
    8298.495     0.998242       215254       568.89
    8376.319     0.998437       215299       640.00
    8478.719     0.998633       215340       731.43
    8650.751     0.998828       215381       853.33
    9183.231     0.999023       215424      1024.00
    9273.343     0.999121       215445      1137.78
    9330.687     0.999219       215467      1280.00
    9396.223     0.999316       215487      1462.86
    9486.335     0.999414       215507      1706.67
    9551.871     0.999512       215528      2048.00
    9584.639     0.999561       215540      2275.56
    9609.215     0.999609       215550      2560.00
    9658.367     0.999658       215562      2925.71
    9682.943     0.999707       215570      3413.33
    9707.519     0.999756       215585      4096.00
    9715.711     0.999780       215587      4551.11
    9732.095     0.999805       215595      5120.00
    9740.287     0.999829       215598      5851.43
    9756.671     0.999854       215602      6826.67
    9773.055     0.999878       215608      8192.00
    9781.247     0.999890       215611      9102.22
    9789.439     0.999902       215613     10240.00
    9805.823     0.999915       215616     11702.86
    9822.207     0.999927       215618     13653.33
    9838.591     0.999939       215620     16384.00
    9854.975     0.999945       215622     18204.44
    9863.167     0.999951       215624     20480.00
    9863.167     0.999957       215624     23405.71
    9871.359     0.999963       215627     27306.67
    9871.359     0.999969       215627     32768.00
    9879.551     0.999973       215629     36408.89
    9879.551     0.999976       215629     40960.00
    9879.551     0.999979       215629     46811.43
    9895.935     0.999982       215630     54613.33
    9895.935     0.999985       215630     65536.00
    9904.127     0.999986       215631     72817.78
    9904.127     0.999988       215631     81920.00
    9904.127     0.999989       215631     93622.86
    9912.319     0.999991       215632    109226.67
    9912.319     0.999992       215632    131072.00
    9912.319     0.999993       215632    145635.56
    9912.319     0.999994       215632    163840.00
    9912.319     0.999995       215632    187245.71
    9920.511     0.999995       215633    218453.33
    9920.511     1.000000       215633          inf
#[Mean    =     1790.018, StdDeviation   =     1488.603]
#[Max     =     9912.320, Total count    =       215633]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  234553 requests in 2.00m, 2.92GB read
  Non-2xx or 3xx responses: 6
Requests/sec:   1955.28  
Transfer/sec:     24.88MB